<template>
  <div class="md-body">
    <h1>В этом приложении:</h1>
    <ul>
      <li>Полная настройка VUE CLI 3 на Vue 3</li>
      <li>Vue-router + VUEX + Vue 3</li>
      <li>Динамическая перерисовка без перезагрузки страницы</li>
      <li>Обработка несуществующих роутов</li>
      <li>Хеши и моды для роутера</li>
      <li>Передача данных между компонентами</li>
      <li>Разделение логики по компоненты</li>
      <li>Локальное хранилише</li>
      <li>Настройка общего конфига</li>
    </ul>
    <p>
      Сделано на курсе
      <a href="https://tocode.ru/courses/vuejs-3-s-nulya-do-rezultata/"
        >Cделано на курсе "Vue.js 3 c нуля до результата"</a
      >
    </p>
  </div>
</template>